HomeTask2/statistics.json
{
  "Open Random Product Page  /hp-spectre-xt-pro-ultrabook" : {
    "transaction" : "Open Random Product Page  /hp-spectre-xt-pro-ultrabook",
    "sampleCount" : 11,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 494.27272727272725,
    "medianResTime" : 463.0,
    "minResTime" : 430.0,
    "maxResTime" : 683.0,
    "pct1ResTime" : 650.8000000000002,
    "pct2ResTime" : 683.0,
    "pct3ResTime" : 683.0,
    "throughput" : 0.052484421669386314,
    "receivedKBytesPerSec" : 0.6479011748160659,
    "sentKBytesPerSec" : 0.04085901044201425
  },
  "Open Random Product Page  /samsung-series-9-np900x4c-premium-ultrabook" : {
    "transaction" : "Open Random Product Page  /samsung-series-9-np900x4c-premium-ultrabook",
    "sampleCount" : 53,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 484.6226415094339,
    "medianResTime" : 471.0,
    "minResTime" : 404.0,
    "maxResTime" : 834.0,
    "pct1ResTime" : 601.0000000000002,
    "pct2ResTime" : 684.6999999999998,
    "pct3ResTime" : 834.0,
    "throughput" : 0.26301424246935634,
    "receivedKBytesPerSec" : 3.2524169085901447,
    "sentKBytesPerSec" : 0.20866384577688454
  },
  "ADD TO CART /htc-one-mini-blue" : {
    "transaction" : "ADD TO CART /htc-one-mini-blue",
    "sampleCount" : 35,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 330.94285714285706,
    "medianResTime" : 314.0,
    "minResTime" : 289.0,
    "maxResTime" : 535.0,
    "pct1ResTime" : 392.9999999999999,
    "pct2ResTime" : 490.9999999999998,
    "pct3ResTime" : 535.0,
    "throughput" : 0.16689475616676125,
    "receivedKBytesPerSec" : 0.4169155807579883,
    "sentKBytesPerSec" : 0.1790253599562259
  },
  "Shopping Cart" : {
    "transaction" : "Shopping Cart",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 557.6079999999997,
    "medianResTime" : 544.0,
    "minResTime" : 391.0,
    "maxResTime" : 1844.0,
    "pct1ResTime" : 618.6000000000001,
    "pct2ResTime" : 729.9,
    "pct3ResTime" : 893.96,
    "throughput" : 2.315093483474863,
    "receivedKBytesPerSec" : 26.285033333005362,
    "sentKBytesPerSec" : 1.7502151951739562
  },
  "ADD TO CART /night-visions" : {
    "transaction" : "ADD TO CART /night-visions",
    "sampleCount" : 61,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 325.42622950819674,
    "medianResTime" : 316.0,
    "minResTime" : 294.0,
    "maxResTime" : 525.0,
    "pct1ResTime" : 341.8,
    "pct2ResTime" : 355.9,
    "pct3ResTime" : 525.0,
    "throughput" : 0.29305366725437537,
    "receivedKBytesPerSec" : 0.737973164571253,
    "sentKBytesPerSec" : 0.3144049614346178
  },
  "ADD TO CART /samsung-series-9-np900x4c-premium-ultrabook" : {
    "transaction" : "ADD TO CART /samsung-series-9-np900x4c-premium-ultrabook",
    "sampleCount" : 53,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 321.35849056603774,
    "medianResTime" : 316.0,
    "minResTime" : 294.0,
    "maxResTime" : 390.0,
    "pct1ResTime" : 350.6,
    "pct2ResTime" : 376.7,
    "pct3ResTime" : 390.0,
    "throughput" : 0.2632140923831801,
    "receivedKBytesPerSec" : 0.6625213939048555,
    "sentKBytesPerSec" : 0.2815952357007703
  },
  "ADD TO CART /flower-girl-bracelet" : {
    "transaction" : "ADD TO CART /flower-girl-bracelet",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 323.94166666666666,
    "medianResTime" : 315.0,
    "minResTime" : 281.0,
    "maxResTime" : 506.0,
    "pct1ResTime" : 348.8,
    "pct2ResTime" : 390.1499999999998,
    "pct3ResTime" : 501.3799999999998,
    "throughput" : 0.5637693619540246,
    "receivedKBytesPerSec" : 1.4177459766834388,
    "sentKBytesPerSec" : 0.6045334470855472
  },
  "Open Random Product Page  /htc-one-mini-blue" : {
    "transaction" : "Open Random Product Page  /htc-one-mini-blue",
    "sampleCount" : 35,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 470.3714285714286,
    "medianResTime" : 459.0,
    "minResTime" : 386.0,
    "maxResTime" : 705.0,
    "pct1ResTime" : 536.1999999999999,
    "pct2ResTime" : 656.1999999999997,
    "pct3ResTime" : 705.0,
    "throughput" : 0.16689475616676125,
    "receivedKBytesPerSec" : 1.9954493984040094,
    "sentKBytesPerSec" : 0.1282817171563041
  },
  "Open Random Product Page  /apple-macbook-pro-13-inch" : {
    "transaction" : "Open Random Product Page  /apple-macbook-pro-13-inch",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 396.6,
    "medianResTime" : 374.0,
    "minResTime" : 339.0,
    "maxResTime" : 707.0,
    "pct1ResTime" : 501.00000000000034,
    "pct2ResTime" : 673.0999999999999,
    "pct3ResTime" : 707.0,
    "throughput" : 0.12005724329360239,
    "receivedKBytesPerSec" : 1.1072138570670496,
    "sentKBytesPerSec" : 0.09326009141158503
  },
  "ADD TO CART /pride-and-prejudice" : {
    "transaction" : "ADD TO CART /pride-and-prejudice",
    "sampleCount" : 27,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 322.18518518518516,
    "medianResTime" : 312.0,
    "minResTime" : 293.0,
    "maxResTime" : 465.0,
    "pct1ResTime" : 352.6,
    "pct2ResTime" : 420.9999999999998,
    "pct3ResTime" : 465.0,
    "throughput" : 0.12619122176471412,
    "receivedKBytesPerSec" : 0.3141498698945135,
    "sentKBytesPerSec" : 0.13531963769098107
  },
  "ADD TO CART /htc-one-m8-android-l-50-lollipop" : {
    "transaction" : "ADD TO CART /htc-one-m8-android-l-50-lollipop",
    "sampleCount" : 39,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 333.025641025641,
    "medianResTime" : 317.0,
    "minResTime" : 297.0,
    "maxResTime" : 598.0,
    "pct1ResTime" : 350.0,
    "pct2ResTime" : 576.0,
    "pct3ResTime" : 598.0,
    "throughput" : 0.1941013109303923,
    "receivedKBytesPerSec" : 0.4912022958701214,
    "sentKBytesPerSec" : 0.20819620780784967
  },
  "Open Random Product Page  /ray-ban-aviator-sunglasses" : {
    "transaction" : "Open Random Product Page  /ray-ban-aviator-sunglasses",
    "sampleCount" : 41,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 456.75609756097566,
    "medianResTime" : 449.0,
    "minResTime" : 384.0,
    "maxResTime" : 797.0,
    "pct1ResTime" : 479.0,
    "pct2ResTime" : 552.5999999999999,
    "pct3ResTime" : 797.0,
    "throughput" : 0.20015035685344112,
    "receivedKBytesPerSec" : 2.315230099684641,
    "sentKBytesPerSec" : 0.1555903962610937
  },
  "ADD TO CART /hp-envy-6-1180ca-156-inch-sleekbook" : {
    "transaction" : "ADD TO CART /hp-envy-6-1180ca-156-inch-sleekbook",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 334.8125,
    "medianResTime" : 319.0,
    "minResTime" : 293.0,
    "maxResTime" : 572.0,
    "pct1ResTime" : 418.70000000000016,
    "pct2ResTime" : 572.0,
    "pct3ResTime" : 572.0,
    "throughput" : 0.09193447370386758,
    "receivedKBytesPerSec" : 0.233382484758988,
    "sentKBytesPerSec" : 0.09833689280153071
  },
  "ADD TO CART /ray-ban-aviator-sunglasses" : {
    "transaction" : "ADD TO CART /ray-ban-aviator-sunglasses",
    "sampleCount" : 41,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 320.6585365853659,
    "medianResTime" : 315.0,
    "minResTime" : 288.0,
    "maxResTime" : 439.0,
    "pct1ResTime" : 339.20000000000005,
    "pct2ResTime" : 404.99999999999994,
    "pct3ResTime" : 439.0,
    "throughput" : 0.20029115494719155,
    "receivedKBytesPerSec" : 0.5050691828853651,
    "sentKBytesPerSec" : 0.21483688025764283
  },
  "ADD TO CART /portable-sound-speakers" : {
    "transaction" : "ADD TO CART /portable-sound-speakers",
    "sampleCount" : 27,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 324.3703703703704,
    "medianResTime" : 317.0,
    "minResTime" : 296.0,
    "maxResTime" : 442.0,
    "pct1ResTime" : 374.2,
    "pct2ResTime" : 419.9999999999999,
    "pct3ResTime" : 442.0,
    "throughput" : 0.1326136179450783,
    "receivedKBytesPerSec" : 0.3339562771059779,
    "sentKBytesPerSec" : 0.14224978542379874
  },
  "Open Random Product Page  /beats-pill-20-wireless-speaker" : {
    "transaction" : "Open Random Product Page  /beats-pill-20-wireless-speaker",
    "sampleCount" : 23,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 388.3478260869565,
    "medianResTime" : 362.0,
    "minResTime" : 336.0,
    "maxResTime" : 770.0,
    "pct1ResTime" : 453.40000000000003,
    "pct2ResTime" : 707.3999999999992,
    "pct3ResTime" : 770.0,
    "throughput" : 0.12144701477957368,
    "receivedKBytesPerSec" : 0.9836475967351874,
    "sentKBytesPerSec" : 0.09494235887064836
  },
  "Open Random Product Page  /pride-and-prejudice" : {
    "transaction" : "Open Random Product Page  /pride-and-prejudice",
    "sampleCount" : 27,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 468.4444444444444,
    "medianResTime" : 463.0,
    "minResTime" : 398.0,
    "maxResTime" : 571.0,
    "pct1ResTime" : 533.0,
    "pct2ResTime" : 562.1999999999999,
    "pct3ResTime" : 571.0,
    "throughput" : 0.12609633760192787,
    "receivedKBytesPerSec" : 1.527367429549509,
    "sentKBytesPerSec" : 0.09695297832544063
  },
  "Open Host Page" : {
    "transaction" : "Open Host Page",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 383.8599999999999,
    "medianResTime" : 357.5,
    "minResTime" : 313.0,
    "maxResTime" : 2309.0,
    "pct1ResTime" : 405.0,
    "pct2ResTime" : 472.95,
    "pct3ResTime" : 1406.3300000000006,
    "throughput" : 2.2859546375161734,
    "receivedKBytesPerSec" : 17.917303519341463,
    "sentKBytesPerSec" : 1.7122559243371873
  },
  "ADD TO CART /beats-pill-20-wireless-speaker" : {
    "transaction" : "ADD TO CART /beats-pill-20-wireless-speaker",
    "sampleCount" : 23,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 338.6521739130435,
    "medianResTime" : 319.0,
    "minResTime" : 300.0,
    "maxResTime" : 549.0,
    "pct1ResTime" : 458.40000000000026,
    "pct2ResTime" : 545.1999999999999,
    "pct3ResTime" : 549.0,
    "throughput" : 0.12148999556297407,
    "receivedKBytesPerSec" : 0.30626290831202857,
    "sentKBytesPerSec" : 0.13033144649686237
  },
  "Open Random Product Page  /night-visions" : {
    "transaction" : "Open Random Product Page  /night-visions",
    "sampleCount" : 61,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 389.59016393442624,
    "medianResTime" : 361.0,
    "minResTime" : 311.0,
    "maxResTime" : 1620.0,
    "pct1ResTime" : 412.0,
    "pct2ResTime" : 466.9,
    "pct3ResTime" : 1620.0,
    "throughput" : 0.2933552628415064,
    "receivedKBytesPerSec" : 2.289968827997634,
    "sentKBytesPerSec" : 0.22438878559337114
  },
  "Search Random Product" : {
    "transaction" : "Search Random Product",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 418.41799999999984,
    "medianResTime" : 406.5,
    "minResTime" : 334.0,
    "maxResTime" : 820.0,
    "pct1ResTime" : 457.90000000000003,
    "pct2ResTime" : 504.95,
    "pct3ResTime" : 730.94,
    "throughput" : 2.316090809288451,
    "receivedKBytesPerSec" : 18.0942242195932,
    "sentKBytesPerSec" : 1.7709771239710768
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 423.7691999999994,
    "medianResTime" : 393.5,
    "minResTime" : 281.0,
    "maxResTime" : 2309.0,
    "pct1ResTime" : 560.0,
    "pct2ResTime" : 594.0,
    "pct3ResTime" : 811.8999999999978,
    "throughput" : 11.344350966992478,
    "receivedKBytesPerSec" : 90.09282940591903,
    "sentKBytesPerSec" : 9.340659408834528
  },
  "Open Random Product Page  /htc-one-m8-android-l-50-lollipop" : {
    "transaction" : "Open Random Product Page  /htc-one-m8-android-l-50-lollipop",
    "sampleCount" : 39,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 518.7179487179485,
    "medianResTime" : 458.0,
    "minResTime" : 406.0,
    "maxResTime" : 1607.0,
    "pct1ResTime" : 663.0,
    "pct2ResTime" : 829.0,
    "pct3ResTime" : 1607.0,
    "throughput" : 0.19397580773515838,
    "receivedKBytesPerSec" : 2.299805270359999,
    "sentKBytesPerSec" : 0.15194674462587537
  },
  "Open Random Product Page  /flower-girl-bracelet" : {
    "transaction" : "Open Random Product Page  /flower-girl-bracelet",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 370.8916666666667,
    "medianResTime" : 362.0,
    "minResTime" : 312.0,
    "maxResTime" : 677.0,
    "pct1ResTime" : 407.8,
    "pct2ResTime" : 423.84999999999997,
    "pct3ResTime" : 668.5999999999997,
    "throughput" : 0.5636793228332402,
    "receivedKBytesPerSec" : 4.531448718980022,
    "sentKBytesPerSec" : 0.434360607094374
  },
  "ADD TO CART /hp-spectre-xt-pro-ultrabook" : {
    "transaction" : "ADD TO CART /hp-spectre-xt-pro-ultrabook",
    "sampleCount" : 11,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 348.99999999999994,
    "medianResTime" : 319.0,
    "minResTime" : 292.0,
    "maxResTime" : 612.0,
    "pct1ResTime" : 570.6000000000001,
    "pct2ResTime" : 612.0,
    "pct3ResTime" : 612.0,
    "throughput" : 0.05252276384332937,
    "receivedKBytesPerSec" : 0.13280835935597543,
    "sentKBytesPerSec" : 0.05618779335157306
  },
  "ADD TO CART /first-prize-pies" : {
    "transaction" : "ADD TO CART /first-prize-pies",
    "sampleCount" : 22,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 329.36363636363643,
    "medianResTime" : 315.0,
    "minResTime" : 290.0,
    "maxResTime" : 561.0,
    "pct1ResTime" : 353.7,
    "pct2ResTime" : 529.9499999999996,
    "pct3ResTime" : 561.0,
    "throughput" : 0.11167966211825861,
    "receivedKBytesPerSec" : 0.2799229315149854,
    "sentKBytesPerSec" : 0.11980479378604209
  },
  "Open Random Product Page  /hp-envy-6-1180ca-156-inch-sleekbook" : {
    "transaction" : "Open Random Product Page  /hp-envy-6-1180ca-156-inch-sleekbook",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 491.00000000000006,
    "medianResTime" : 467.5,
    "minResTime" : 419.0,
    "maxResTime" : 826.0,
    "pct1ResTime" : 615.3000000000002,
    "pct2ResTime" : 826.0,
    "pct3ResTime" : 826.0,
    "throughput" : 0.09185108642613163,
    "receivedKBytesPerSec" : 1.1877964529693734,
    "sentKBytesPerSec" : 0.07219594061253194
  },
  "ADD TO CART /apple-macbook-pro-13-inch" : {
    "transaction" : "ADD TO CART /apple-macbook-pro-13-inch",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 330.59999999999997,
    "medianResTime" : 328.0,
    "minResTime" : 293.0,
    "maxResTime" : 478.0,
    "pct1ResTime" : 356.6,
    "pct2ResTime" : 442.2999999999999,
    "pct3ResTime" : 478.0,
    "throughput" : 0.12009242312883996,
    "receivedKBytesPerSec" : 0.30353829056842146,
    "sentKBytesPerSec" : 0.1285082749684157
  },
  "Open Random Product Page  /portable-sound-speakers" : {
    "transaction" : "Open Random Product Page  /portable-sound-speakers",
    "sampleCount" : 27,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 441.6296296296296,
    "medianResTime" : 438.0,
    "minResTime" : 383.0,
    "maxResTime" : 507.0,
    "pct1ResTime" : 481.6,
    "pct2ResTime" : 497.79999999999995,
    "pct3ResTime" : 507.0,
    "throughput" : 0.13252184156277608,
    "receivedKBytesPerSec" : 1.4594034906621183,
    "sentKBytesPerSec" : 0.1026219845145774
  },
  "Open Random Product Page  /first-prize-pies" : {
    "transaction" : "Open Random Product Page  /first-prize-pies",
    "sampleCount" : 22,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 452.9090909090908,
    "medianResTime" : 450.5,
    "minResTime" : 385.0,
    "maxResTime" : 605.0,
    "pct1ResTime" : 494.5,
    "pct2ResTime" : 588.6499999999997,
    "pct3ResTime" : 605.0,
    "throughput" : 0.11276730978205154,
    "receivedKBytesPerSec" : 1.3248757317060669,
    "sentKBytesPerSec" : 0.08658775411088102
  }
}